SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_wdog.h
/**************************************************************************//**
 * @file
 * @brief EFR32SG28 WDOG register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 * 
 * The licensor of this software is Silicon Laboratories Inc.
 * 
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 * 
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 * 
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32SG28_WDOG_H
#define EFR32SG28_WDOG_H

#define WDOG_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32SG28_WDOG WDOG
 * @{
 * @brief EFR32SG28 WDOG Register Declaration.
 *****************************************************************************/

/** WDOG Register Declaration. */
typedef struct
{
  __IM  uint32_t             IPVERSION;              /**< IP Version Register                                */
  __IOM uint32_t             EN;                     /**< Enable Register                                    */
  __IOM uint32_t             CFG;                    /**< Configuration Register                             */
  __IOM uint32_t             CMD;                    /**< Command Register                                   */
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
  __IM  uint32_t             STATUS;                 /**< Status Register                                    */
  __IOM uint32_t             IF;                     /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN;                    /**< Interrupt Enable Register                          */
  __IOM uint32_t             LOCK;                   /**< Lock Register                                      */
  __IM  uint32_t             SYNCBUSY;               /**< Synchronization Busy Register                      */
        uint32_t             RESERVED1[1014U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_SET;          /**< IP Version Register                                */
  __IOM uint32_t             EN_SET;                 /**< Enable Register                                    */
  __IOM uint32_t             CFG_SET;                /**< Configuration Register                             */
  __IOM uint32_t             CMD_SET;                /**< Command Register                                   */
        uint32_t             RESERVED2[1U];          /**< Reserved for future use                            */
  __IM  uint32_t             STATUS_SET;             /**< Status Register                                    */
  __IOM uint32_t             IF_SET;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_SET;                /**< Interrupt Enable Register                          */
  __IOM uint32_t             LOCK_SET;               /**< Lock Register                                      */
  __IM  uint32_t             SYNCBUSY_SET;           /**< Synchronization Busy Register                      */
        uint32_t             RESERVED3[1014U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_CLR;          /**< IP Version Register                                */
  __IOM uint32_t             EN_CLR;                 /**< Enable Register                                    */
  __IOM uint32_t             CFG_CLR;                /**< Configuration Register                             */
  __IOM uint32_t             CMD_CLR;                /**< Command Register                                   */
        uint32_t             RESERVED4[1U];          /**< Reserved for future use                            */
  __IM  uint32_t             STATUS_CLR;             /**< Status Register                                    */
  __IOM uint32_t             IF_CLR;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_CLR;                /**< Interrupt Enable Register                          */
  __IOM uint32_t             LOCK_CLR;               /**< Lock Register                                      */
  __IM  uint32_t             SYNCBUSY_CLR;           /**< Synchronization Busy Register                      */
        uint32_t             RESERVED5[1014U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_TGL;          /**< IP Version Register                                */
  __IOM uint32_t             EN_TGL;                 /**< Enable Register                                    */
  __IOM uint32_t             CFG_TGL;                /**< Configuration Register                             */
  __IOM uint32_t             CMD_TGL;                /**< Command Register                                   */
        uint32_t             RESERVED6[1U];          /**< Reserved for future use                            */
  __IM  uint32_t             STATUS_TGL;             /**< Status Register                                    */
  __IOM uint32_t             IF_TGL;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_TGL;                /**< Interrupt Enable Register                          */
  __IOM uint32_t             LOCK_TGL;               /**< Lock Register                                      */
  __IM  uint32_t             SYNCBUSY_TGL;           /**< Synchronization Busy Register                      */
} WDOG_TypeDef;
/** @} End of group EFR32SG28_WDOG */

/**************************************************************************//**
 * @addtogroup EFR32SG28_WDOG
 * @{
 * @defgroup EFR32SG28_WDOG_BitFields WDOG Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for WDOG IPVERSION */
#define _WDOG_IPVERSION_RESETVALUE              0x00000001UL                            /**< Default value for WDOG_IPVERSION            */
#define _WDOG_IPVERSION_MASK                    0xFFFFFFFFUL                            /**< Mask for WDOG_IPVERSION                     */
#define _WDOG_IPVERSION_IPVERSION_SHIFT         0                                       /**< Shift value for WDOG_IPVERSION              */
#define _WDOG_IPVERSION_IPVERSION_MASK          0xFFFFFFFFUL                            /**< Bit mask for WDOG_IPVERSION                 */
#define _WDOG_IPVERSION_IPVERSION_DEFAULT       0x00000001UL                            /**< Mode DEFAULT for WDOG_IPVERSION             */
#define WDOG_IPVERSION_IPVERSION_DEFAULT        (_WDOG_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for WDOG_IPVERSION     */

/* Bit fields for WDOG EN */
#define _WDOG_EN_RESETVALUE                     0x00000000UL                            /**< Default value for WDOG_EN                   */
#define _WDOG_EN_MASK                           0x00000003UL                            /**< Mask for WDOG_EN                            */
#define WDOG_EN_EN                              (0x1UL << 0)                            /**< Module Enable                               */
#define _WDOG_EN_EN_SHIFT                       0                                       /**< Shift value for WDOG_EN                     */
#define _WDOG_EN_EN_MASK                        0x1UL                                   /**< Bit mask for WDOG_EN                        */
#define _WDOG_EN_EN_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for WDOG_EN                    */
#define WDOG_EN_EN_DEFAULT                      (_WDOG_EN_EN_DEFAULT << 0)              /**< Shifted mode DEFAULT for WDOG_EN            */
#define WDOG_EN_DISABLING                       (0x1UL << 1)                            /**< Disabling busy status                       */
#define _WDOG_EN_DISABLING_SHIFT                1                                       /**< Shift value for WDOG_DISABLING              */
#define _WDOG_EN_DISABLING_MASK                 0x2UL                                   /**< Bit mask for WDOG_DISABLING                 */
#define _WDOG_EN_DISABLING_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for WDOG_EN                    */
#define WDOG_EN_DISABLING_DEFAULT               (_WDOG_EN_DISABLING_DEFAULT << 1)       /**< Shifted mode DEFAULT for WDOG_EN            */

