SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_wdog.h
/* Bit fields for WDOG CMD */
#define _WDOG_CMD_RESETVALUE                    0x00000000UL                            /**< Default value for WDOG_CMD                  */
#define _WDOG_CMD_MASK                          0x00000001UL                            /**< Mask for WDOG_CMD                           */
#define WDOG_CMD_CLEAR                          (0x1UL << 0)                            /**< WDOG Timer Clear                            */
#define _WDOG_CMD_CLEAR_SHIFT                   0                                       /**< Shift value for WDOG_CLEAR                  */
#define _WDOG_CMD_CLEAR_MASK                    0x1UL                                   /**< Bit mask for WDOG_CLEAR                     */
#define _WDOG_CMD_CLEAR_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for WDOG_CMD                   */
#define _WDOG_CMD_CLEAR_UNCHANGED               0x00000000UL                            /**< Mode UNCHANGED for WDOG_CMD                 */
#define _WDOG_CMD_CLEAR_CLEARED                 0x00000001UL                            /**< Mode CLEARED for WDOG_CMD                   */
#define WDOG_CMD_CLEAR_DEFAULT                  (_WDOG_CMD_CLEAR_DEFAULT << 0)          /**< Shifted mode DEFAULT for WDOG_CMD           */
#define WDOG_CMD_CLEAR_UNCHANGED                (_WDOG_CMD_CLEAR_UNCHANGED << 0)        /**< Shifted mode UNCHANGED for WDOG_CMD         */
#define WDOG_CMD_CLEAR_CLEARED                  (_WDOG_CMD_CLEAR_CLEARED << 0)          /**< Shifted mode CLEARED for WDOG_CMD           */

/* Bit fields for WDOG STATUS */
#define _WDOG_STATUS_RESETVALUE                 0x00000000UL                            /**< Default value for WDOG_STATUS               */
#define _WDOG_STATUS_MASK                       0x80000000UL                            /**< Mask for WDOG_STATUS                        */
#define WDOG_STATUS_LOCK                        (0x1UL << 31)                           /**< WDOG Configuration Lock Status              */
#define _WDOG_STATUS_LOCK_SHIFT                 31                                      /**< Shift value for WDOG_LOCK                   */
#define _WDOG_STATUS_LOCK_MASK                  0x80000000UL                            /**< Bit mask for WDOG_LOCK                      */
#define _WDOG_STATUS_LOCK_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for WDOG_STATUS                */
#define _WDOG_STATUS_LOCK_UNLOCKED              0x00000000UL                            /**< Mode UNLOCKED for WDOG_STATUS               */
#define _WDOG_STATUS_LOCK_LOCKED                0x00000001UL                            /**< Mode LOCKED for WDOG_STATUS                 */
#define WDOG_STATUS_LOCK_DEFAULT                (_WDOG_STATUS_LOCK_DEFAULT << 31)       /**< Shifted mode DEFAULT for WDOG_STATUS        */
#define WDOG_STATUS_LOCK_UNLOCKED               (_WDOG_STATUS_LOCK_UNLOCKED << 31)      /**< Shifted mode UNLOCKED for WDOG_STATUS       */
#define WDOG_STATUS_LOCK_LOCKED                 (_WDOG_STATUS_LOCK_LOCKED << 31)        /**< Shifted mode LOCKED for WDOG_STATUS         */

/* Bit fields for WDOG IF */
#define _WDOG_IF_RESETVALUE                     0x00000000UL                            /**< Default value for WDOG_IF                   */
#define _WDOG_IF_MASK                           0x0000001FUL                            /**< Mask for WDOG_IF                            */
#define WDOG_IF_TOUT                            (0x1UL << 0)                            /**< WDOG Timeout Interrupt Flag                 */
#define _WDOG_IF_TOUT_SHIFT                     0                                       /**< Shift value for WDOG_TOUT                   */
#define _WDOG_IF_TOUT_MASK                      0x1UL                                   /**< Bit mask for WDOG_TOUT                      */
#define _WDOG_IF_TOUT_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for WDOG_IF                    */
#define WDOG_IF_TOUT_DEFAULT                    (_WDOG_IF_TOUT_DEFAULT << 0)            /**< Shifted mode DEFAULT for WDOG_IF            */
#define WDOG_IF_WARN                            (0x1UL << 1)                            /**< WDOG Warning Timeout Interrupt Flag         */
#define _WDOG_IF_WARN_SHIFT                     1                                       /**< Shift value for WDOG_WARN                   */
#define _WDOG_IF_WARN_MASK                      0x2UL                                   /**< Bit mask for WDOG_WARN                      */
#define _WDOG_IF_WARN_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for WDOG_IF                    */
#define WDOG_IF_WARN_DEFAULT                    (_WDOG_IF_WARN_DEFAULT << 1)            /**< Shifted mode DEFAULT for WDOG_IF            */
#define WDOG_IF_WIN                             (0x1UL << 2)                            /**< WDOG Window Interrupt Flag                  */
#define _WDOG_IF_WIN_SHIFT                      2                                       /**< Shift value for WDOG_WIN                    */
#define _WDOG_IF_WIN_MASK                       0x4UL                                   /**< Bit mask for WDOG_WIN                       */
#define _WDOG_IF_WIN_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for WDOG_IF                    */
#define WDOG_IF_WIN_DEFAULT                     (_WDOG_IF_WIN_DEFAULT << 2)             /**< Shifted mode DEFAULT for WDOG_IF            */
#define WDOG_IF_PEM0                            (0x1UL << 3)                            /**< PRS Src0 Event Missing Interrupt Flag       */
#define _WDOG_IF_PEM0_SHIFT                     3                                       /**< Shift value for WDOG_PEM0                   */
#define _WDOG_IF_PEM0_MASK                      0x8UL                                   /**< Bit mask for WDOG_PEM0                      */
#define _WDOG_IF_PEM0_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for WDOG_IF                    */
#define WDOG_IF_PEM0_DEFAULT                    (_WDOG_IF_PEM0_DEFAULT << 3)            /**< Shifted mode DEFAULT for WDOG_IF            */
#define WDOG_IF_PEM1                            (0x1UL << 4)                            /**< PRS Src1 Event Missing Interrupt Flag       */
#define _WDOG_IF_PEM1_SHIFT                     4                                       /**< Shift value for WDOG_PEM1                   */
#define _WDOG_IF_PEM1_MASK                      0x10UL                                  /**< Bit mask for WDOG_PEM1                      */
#define _WDOG_IF_PEM1_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for WDOG_IF                    */
#define WDOG_IF_PEM1_DEFAULT                    (_WDOG_IF_PEM1_DEFAULT << 4)            /**< Shifted mode DEFAULT for WDOG_IF            */

/* Bit fields for WDOG IEN */
#define _WDOG_IEN_RESETVALUE                    0x00000000UL                            /**< Default value for WDOG_IEN                  */
#define _WDOG_IEN_MASK                          0x0000001FUL                            /**< Mask for WDOG_IEN                           */
#define WDOG_IEN_TOUT                           (0x1UL << 0)                            /**< WDOG Timeout Interrupt Enable               */
#define _WDOG_IEN_TOUT_SHIFT                    0                                       /**< Shift value for WDOG_TOUT                   */
#define _WDOG_IEN_TOUT_MASK                     0x1UL                                   /**< Bit mask for WDOG_TOUT                      */
#define _WDOG_IEN_TOUT_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for WDOG_IEN                   */
#define WDOG_IEN_TOUT_DEFAULT                   (_WDOG_IEN_TOUT_DEFAULT << 0)           /**< Shifted mode DEFAULT for WDOG_IEN           */
#define WDOG_IEN_WARN                           (0x1UL << 1)                            /**< WDOG Warning Timeout Interrupt Enable       */
#define _WDOG_IEN_WARN_SHIFT                    1                                       /**< Shift value for WDOG_WARN                   */
#define _WDOG_IEN_WARN_MASK                     0x2UL                                   /**< Bit mask for WDOG_WARN                      */
#define _WDOG_IEN_WARN_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for WDOG_IEN                   */
#define WDOG_IEN_WARN_DEFAULT                   (_WDOG_IEN_WARN_DEFAULT << 1)           /**< Shifted mode DEFAULT for WDOG_IEN           */
#define WDOG_IEN_WIN                            (0x1UL << 2)                            /**< WDOG Window Interrupt Enable                */
#define _WDOG_IEN_WIN_SHIFT                     2                                       /**< Shift value for WDOG_WIN                    */
#define _WDOG_IEN_WIN_MASK                      0x4UL                                   /**< Bit mask for WDOG_WIN                       */
#define _WDOG_IEN_WIN_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for WDOG_IEN                   */
#define WDOG_IEN_WIN_DEFAULT                    (_WDOG_IEN_WIN_DEFAULT << 2)            /**< Shifted mode DEFAULT for WDOG_IEN           */
#define WDOG_IEN_PEM0                           (0x1UL << 3)                            /**< PRS Src0 Event Missing Interrupt Enable     */
#define _WDOG_IEN_PEM0_SHIFT                    3                                       /**< Shift value for WDOG_PEM0                   */
#define _WDOG_IEN_PEM0_MASK                     0x8UL                                   /**< Bit mask for WDOG_PEM0                      */
#define _WDOG_IEN_PEM0_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for WDOG_IEN                   */
#define WDOG_IEN_PEM0_DEFAULT                   (_WDOG_IEN_PEM0_DEFAULT << 3)           /**< Shifted mode DEFAULT for WDOG_IEN           */
#define WDOG_IEN_PEM1                           (0x1UL << 4)                            /**< PRS Src1 Event Missing Interrupt Enable     */
#define _WDOG_IEN_PEM1_SHIFT                    4                                       /**< Shift value for WDOG_PEM1                   */
#define _WDOG_IEN_PEM1_MASK                     0x10UL                                  /**< Bit mask for WDOG_PEM1                      */
#define _WDOG_IEN_PEM1_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for WDOG_IEN                   */
#define WDOG_IEN_PEM1_DEFAULT                   (_WDOG_IEN_PEM1_DEFAULT << 4)           /**< Shifted mode DEFAULT for WDOG_IEN           */

