SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_wdog.h
/* Bit fields for WDOG LOCK */
#define _WDOG_LOCK_RESETVALUE                   0x0000ABE8UL                            /**< Default value for WDOG_LOCK                 */
#define _WDOG_LOCK_MASK                         0x0000FFFFUL                            /**< Mask for WDOG_LOCK                          */
#define _WDOG_LOCK_LOCKKEY_SHIFT                0                                       /**< Shift value for WDOG_LOCKKEY                */
#define _WDOG_LOCK_LOCKKEY_MASK                 0xFFFFUL                                /**< Bit mask for WDOG_LOCKKEY                   */
#define _WDOG_LOCK_LOCKKEY_DEFAULT              0x0000ABE8UL                            /**< Mode DEFAULT for WDOG_LOCK                  */
#define _WDOG_LOCK_LOCKKEY_LOCK                 0x00000000UL                            /**< Mode LOCK for WDOG_LOCK                     */
#define _WDOG_LOCK_LOCKKEY_UNLOCK               0x0000ABE8UL                            /**< Mode UNLOCK for WDOG_LOCK                   */
#define WDOG_LOCK_LOCKKEY_DEFAULT               (_WDOG_LOCK_LOCKKEY_DEFAULT << 0)       /**< Shifted mode DEFAULT for WDOG_LOCK          */
#define WDOG_LOCK_LOCKKEY_LOCK                  (_WDOG_LOCK_LOCKKEY_LOCK << 0)          /**< Shifted mode LOCK for WDOG_LOCK             */
#define WDOG_LOCK_LOCKKEY_UNLOCK                (_WDOG_LOCK_LOCKKEY_UNLOCK << 0)        /**< Shifted mode UNLOCK for WDOG_LOCK           */

/* Bit fields for WDOG SYNCBUSY */
#define _WDOG_SYNCBUSY_RESETVALUE               0x00000000UL                            /**< Default value for WDOG_SYNCBUSY             */
#define _WDOG_SYNCBUSY_MASK                     0x00000001UL                            /**< Mask for WDOG_SYNCBUSY                      */
#define WDOG_SYNCBUSY_CMD                       (0x1UL << 0)                            /**< Sync Busy for Cmd Register                  */
#define _WDOG_SYNCBUSY_CMD_SHIFT                0                                       /**< Shift value for WDOG_CMD                    */
#define _WDOG_SYNCBUSY_CMD_MASK                 0x1UL                                   /**< Bit mask for WDOG_CMD                       */
#define _WDOG_SYNCBUSY_CMD_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for WDOG_SYNCBUSY              */
#define WDOG_SYNCBUSY_CMD_DEFAULT               (_WDOG_SYNCBUSY_CMD_DEFAULT << 0)       /**< Shifted mode DEFAULT for WDOG_SYNCBUSY      */

/** @} End of group EFR32SG28_WDOG_BitFields */
/** @} End of group EFR32SG28_WDOG */
/** @} End of group Parts */

#endif // EFR32SG28_WDOG_H
